nguyenmanhthao996tn/all-new-uca21-core/boards.txt
###########################################################################################################
## This file is created by MCUdude for use with MiniCore                                                 ##
## https://github.com/MCUdude/MiniCore                                                                   ##
##                                                                                                       ##
## This is the file where fuse settings, clock frequencies, upload ports, bootloaders and                ##
## compiler flags are located.                                                                           ##
##                                                                                                       ##
###########################################################################################################

# Menu options
menu.clock=Clock
menu.BOD=BOD
menu.eeprom=EEPROM
menu.LTO=Compiler LTO
menu.variant=Variant
menu.bootloader=Bootloader
menu.baudrate=Baud rate

#############################
####        UCA21        ####
#############################

# General
uca21.name=UCA21
uca21.upload.tool=avrdude
uca21.upload.maximum_data_size=2048
uca21.bootloader.tool=avrdude
uca21.bootloader.unlock_bits=0xff
uca21.bootloader.lock_bits=0xff
uca21.build.core=MCUdude_corefiles
uca21.build.board=AVR_ATmega328
uca21.build.bootloader_led=led+b5
uca21.build.extra_flags={build.clkpr}

# DEFAULT by UCA21: Disabled BOD
uca21.BOD.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}111

# DEFAULT by UCA21: Bootloader on UART0
uca21.upload.maximum_size=32384
uca21.upload.protocol=urclock
uca21.upload.uartpins=uart0_rxd0_txd1
uca21.build.export_merged_output=true
uca21.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

# DEFAULT by UCA21: MCU Variant is 328PB
uca21.modelPB=328PB
uca21.bootloader.cksel_bits=1111
uca21.bootloader.cfd_bit=0
uca21.build.variant=pb-variant
uca21.build.mcu=atmega328pb

# DEFAULT by UCA21: Crystal of 8 MHz
uca21.upload.default_speed=57600
uca21.upload.speed={upload.default_speed}
uca21.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21.build.clkpr=
uca21.build.f_cpu=8000000L

# DEFAULT by UCA21: Compiler link time optimization enabled
uca21.compiler.c.extra_flags=-Wextra -flto -g
uca21.compiler.c.elf.extra_flags=-w -flto -g
uca21.compiler.cpp.extra_flags=-Wextra -flto -g
uca21.ltoarcmd=avr-gcc-ar

# DEFAULT by UCA21: EEPROM retained
uca21.bootloader.high_fuses=0xd7

#############################
#### ATmega328/A/P/PA/PB ####
#############################

# General
uca21_advance.name=UCA21 (Advanced options)
uca21_advance.upload.tool=avrdude
uca21_advance.upload.maximum_data_size=2048
uca21_advance.bootloader.tool=avrdude
uca21_advance.bootloader.unlock_bits=0xff
uca21_advance.bootloader.lock_bits=0xff
uca21_advance.build.core=MCUdude_corefiles
uca21_advance.build.board=AVR_ATmega328
uca21_advance.build.bootloader_led=led+b5
uca21_advance.build.extra_flags={build.clkpr}

# Upload port select
uca21_advance.menu.bootloader.uart0=Yes (UART0)
uca21_advance.menu.bootloader.uart0.upload.maximum_size=32384
uca21_advance.menu.bootloader.uart0.upload.protocol=urclock
uca21_advance.menu.bootloader.uart0.upload.uartpins=uart0_rxd0_txd1
uca21_advance.menu.bootloader.uart0.build.export_merged_output=true
uca21_advance.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

uca21_advance.menu.bootloader.uart1=Yes (UART1 328PB only)
uca21_advance.menu.bootloader.uart1.upload.maximum_size=32384
uca21_advance.menu.bootloader.uart1.upload.protocol=urclock
uca21_advance.menu.bootloader.uart1.upload.uartpins=uart1_rxb4_txb3
uca21_advance.menu.bootloader.uart1.build.export_merged_output=true
uca21_advance.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

uca21_advance.menu.bootloader.no_bootloader=No bootloader
uca21_advance.menu.bootloader.no_bootloader.upload.maximum_size=32768
uca21_advance.menu.bootloader.no_bootloader.build.export_merged_output=false
uca21_advance.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
uca21_advance.menu.eeprom.keep=EEPROM retained
uca21_advance.menu.eeprom.keep.bootloader.high_fuses=0xd7
uca21_advance.menu.eeprom.erase=EEPROM not retained
uca21_advance.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Baud rate
uca21_advance.menu.baudrate.default=Default
uca21_advance.menu.baudrate.default.upload.speed={upload.default_speed}
uca21_advance.menu.baudrate.1000000=1000000
uca21_advance.menu.baudrate.1000000.upload.speed=1000000
uca21_advance.menu.baudrate.500000=500000
uca21_advance.menu.baudrate.500000.upload.speed=500000
uca21_advance.menu.baudrate.460800=460800
uca21_advance.menu.baudrate.460800.upload.speed=460800
uca21_advance.menu.baudrate.250000=250000
uca21_advance.menu.baudrate.250000.upload.speed=250000
uca21_advance.menu.baudrate.230400=230400
uca21_advance.menu.baudrate.230400.upload.speed=230400
uca21_advance.menu.baudrate.125000=125000
uca21_advance.menu.baudrate.125000.upload.speed=125000
uca21_advance.menu.baudrate.115200=115200
uca21_advance.menu.baudrate.115200.upload.speed=115200
uca21_advance.menu.baudrate.57600=57600
uca21_advance.menu.baudrate.57600.upload.speed=57600
uca21_advance.menu.baudrate.38400=38400
uca21_advance.menu.baudrate.38400.upload.speed=38400
uca21_advance.menu.baudrate.19200=19200
uca21_advance.menu.baudrate.19200.upload.speed=19200
uca21_advance.menu.baudrate.9600=9600
uca21_advance.menu.baudrate.9600.upload.speed=9600
uca21_advance.menu.baudrate.4800=4800
uca21_advance.menu.baudrate.4800.upload.speed=4800

# Variants
uca21_advance.menu.variant.modelPB=328PB
uca21_advance.menu.variant.modelPB.bootloader.cksel_bits=1111
uca21_advance.menu.variant.modelPB.bootloader.cfd_bit=0
uca21_advance.menu.variant.modelPB.build.variant=pb-variant
uca21_advance.menu.variant.modelPB.build.mcu=atmega328pb

uca21_advance.menu.variant.modelP=328P / 328PA
uca21_advance.menu.variant.modelP.bootloader.cksel_bits=0111
uca21_advance.menu.variant.modelP.bootloader.cfd_bit=1
uca21_advance.menu.variant.modelP.build.variant=standard
uca21_advance.menu.variant.modelP.build.mcu=atmega328p

uca21_advance.menu.variant.modelNonP=328 / 328A
uca21_advance.menu.variant.modelNonP.bootloader.cksel_bits=0111
uca21_advance.menu.variant.modelNonP.bootloader.cfd_bit=1
uca21_advance.menu.variant.modelNonP.build.variant=standard
uca21_advance.menu.variant.modelNonP.build.mcu=atmega328

# Brown out detection
uca21_advance.menu.BOD.disabled=BOD  disabled
uca21_advance.menu.BOD.disabled.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}111
uca21_advance.menu.BOD.2v7=BOD 2.7V
uca21_advance.menu.BOD.2v7.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}101
uca21_advance.menu.BOD.4v3=BOD 4.3V
uca21_advance.menu.BOD.4v3.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}100
uca21_advance.menu.BOD.1v8=BOD 1.8V
uca21_advance.menu.BOD.1v8.bootloader.extended_fuses=0b1111{bootloader.cfd_bit}110

# Compiler link time optimization
uca21_advance.menu.LTO.Os_flto=LTO enabled
uca21_advance.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
uca21_advance.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
uca21_advance.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
uca21_advance.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

uca21_advance.menu.LTO.Os=LTO disabled
uca21_advance.menu.LTO.Os.compiler.c.extra_flags=
uca21_advance.menu.LTO.Os.compiler.c.elf.extra_flags=
uca21_advance.menu.LTO.Os.compiler.cpp.extra_flags=
uca21_advance.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
uca21_advance.menu.clock.8MHz_external=External 8 MHz
uca21_advance.menu.clock.8MHz_external.upload.default_speed=57600
uca21_advance.menu.clock.8MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.8MHz_external.build.clkpr=
uca21_advance.menu.clock.8MHz_external.build.f_cpu=8000000L

uca21_advance.menu.clock.16MHz_external=External 16 MHz
uca21_advance.menu.clock.16MHz_external.upload.default_speed=115200
uca21_advance.menu.clock.16MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.16MHz_external.build.clkpr=
uca21_advance.menu.clock.16MHz_external.build.f_cpu=16000000L

uca21_advance.menu.clock.20MHz_external=External 20 MHz
uca21_advance.menu.clock.20MHz_external.upload.default_speed=115200
uca21_advance.menu.clock.20MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.20MHz_external.build.clkpr=
uca21_advance.menu.clock.20MHz_external.build.f_cpu=20000000L

uca21_advance.menu.clock.18_432MHz_external=External 18.432 MHz
uca21_advance.menu.clock.18_432MHz_external.upload.default_speed=115200
uca21_advance.menu.clock.18_432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.18_432MHz_external.build.clkpr=
uca21_advance.menu.clock.18_432MHz_external.build.f_cpu=18432000L

uca21_advance.menu.clock.14_7456MHz_external=External 14.7456 MHz
uca21_advance.menu.clock.14_7456MHz_external.upload.default_speed=115200
uca21_advance.menu.clock.14_7456MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.14_7456MHz_external.build.clkpr=
uca21_advance.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

uca21_advance.menu.clock.12MHz_external=External 12 MHz
uca21_advance.menu.clock.12MHz_external.upload.default_speed=57600
uca21_advance.menu.clock.12MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.12MHz_external.build.clkpr=
uca21_advance.menu.clock.12MHz_external.build.f_cpu=12000000L

uca21_advance.menu.clock.11_0592MHz_external=External 11.0592 MHz
uca21_advance.menu.clock.11_0592MHz_external.upload.default_speed=115200
uca21_advance.menu.clock.11_0592MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.11_0592MHz_external.build.clkpr=
uca21_advance.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

uca21_advance.menu.clock.9_216MHz_external=External 9.216 MHz
uca21_advance.menu.clock.9_216MHz_external.upload.default_speed=115200
uca21_advance.menu.clock.9_216MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.9_216MHz_external.build.clkpr=
uca21_advance.menu.clock.9_216MHz_external.build.f_cpu=9216000L

uca21_advance.menu.clock.7_3728MHz_external=External 7.3728 MHz
uca21_advance.menu.clock.7_3728MHz_external.upload.default_speed=115200
uca21_advance.menu.clock.7_3728MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.7_3728MHz_external.build.clkpr=
uca21_advance.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

uca21_advance.menu.clock.6MHz_external=External 6 MHz
uca21_advance.menu.clock.6MHz_external.upload.default_speed=57600
uca21_advance.menu.clock.6MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.6MHz_external.build.clkpr=
uca21_advance.menu.clock.6MHz_external.build.f_cpu=6000000L

uca21_advance.menu.clock.4MHz_external=External 4 MHz
uca21_advance.menu.clock.4MHz_external.upload.default_speed=9600
uca21_advance.menu.clock.4MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.4MHz_external.build.clkpr=
uca21_advance.menu.clock.4MHz_external.build.f_cpu=4000000L

uca21_advance.menu.clock.3_6864MHz_external=External 3.6864 MHz
uca21_advance.menu.clock.3_6864MHz_external.upload.default_speed=115200
uca21_advance.menu.clock.3_6864MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.3_6864MHz_external.build.clkpr=
uca21_advance.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

uca21_advance.menu.clock.2MHz_external=External 2 MHz
uca21_advance.menu.clock.2MHz_external.upload.default_speed=9600
uca21_advance.menu.clock.2MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.2MHz_external.build.clkpr=
uca21_advance.menu.clock.2MHz_external.build.f_cpu=2000000L

uca21_advance.menu.clock.1_8432MHz_external=External 1.8432 MHz
uca21_advance.menu.clock.1_8432MHz_external.upload.default_speed=115200
uca21_advance.menu.clock.1_8432MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.1_8432MHz_external.build.clkpr=
uca21_advance.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

uca21_advance.menu.clock.1MHz_external=External 1 MHz
uca21_advance.menu.clock.1MHz_external.upload.default_speed=9600
uca21_advance.menu.clock.1MHz_external.bootloader.low_fuses=0b1111{bootloader.cksel_bits}
uca21_advance.menu.clock.1MHz_external.build.clkpr=
uca21_advance.menu.clock.1MHz_external.build.f_cpu=1000000L

uca21_advance.menu.clock.8MHz_internal=Internal 8 MHz
uca21_advance.menu.clock.8MHz_internal.upload.default_speed=38400
uca21_advance.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
uca21_advance.menu.clock.8MHz_internal.build.clkpr=
uca21_advance.menu.clock.8MHz_internal.build.f_cpu=8000000L

uca21_advance.menu.clock.4MHz_internal=Internal 4 MHz
uca21_advance.menu.clock.4MHz_internal.upload.default_speed=9600
uca21_advance.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
uca21_advance.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
uca21_advance.menu.clock.4MHz_internal.build.f_cpu=4000000L

uca21_advance.menu.clock.2MHz_internal=Internal 2 MHz
uca21_advance.menu.clock.2MHz_internal.upload.default_speed=9600
uca21_advance.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
uca21_advance.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
uca21_advance.menu.clock.2MHz_internal.build.f_cpu=2000000L

uca21_advance.menu.clock.1MHz_internal=Internal 1 MHz
uca21_advance.menu.clock.1MHz_internal.upload.default_speed=9600
uca21_advance.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
uca21_advance.menu.clock.1MHz_internal.build.clkpr=
uca21_advance.menu.clock.1MHz_internal.build.f_cpu=1000000L